<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
    <p>
        1. 수집하는 개인정보 항목
        회사는 회원가입 및 서비스 제공을 위해 다음과 같은 개인정보를 수집합니다.
        [필수 항목]

        - 이름
        - 이메일 주소
        - 비밀번호 (암호화 저장)
        - 휴대전화번호

        [선택 항목]

        - 생년월일
        - 성별

        2. 개인정보의 수집 및 이용 목적
        회사는 수집한 개인정보를 다음의 목적으로 활용합니다.
        가. 회원 관리

        - 회원제 서비스 이용에 따른 본인 확인
        - 개인 식별 및 중복가입 방지
        - 부정 이용 방지 및 비인가 사용 방지
        - 가입 의사 확인
        - 회원 탈퇴 의사 확인
        - 분쟁 조정을 위한 기록 보존
        - 불만 처리 등 민원 처리
        - 공지사항 전달

        나. 서비스 제공

        - 여행 코스 추천 및 맞춤형 콘텐츠 제공
        - 커뮤니티 활동 지원 (게시글 작성, 리뷰 작성 등)
        - 본인 작성 게시물 관리
        - 서비스 이용 기록 보관
        - 고객 문의 대응 및 서비스 개선


        3. 개인정보의 보유 및 이용 기간
        회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.
        가. 회원 탈퇴 시

        - 탈퇴 즉시 개인정보 파기 (단, 아래 법령에 따른 보관 제외)

        나. 관련 법령에 따른 보관

        계약 또는 청약철회 등에 관한 기록

        - 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률
        보존 기간: 5년


        - 대금결제 및 재화 등의 공급에 관한 기록

        - 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률
        - 보존 기간: 5년


        소비자의 불만 또는 분쟁처리에 관한 기록

        - 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률
        - 보존 기간: 3년


        표시/광고에 관한 기록

        - 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률
        - 보존 기간: 6개월


        웹사이트 방문기록 (로그 기록, IP 등)

        - 보존 이유: 통신비밀보호법
        - 보존 기간: 3개월



        4. 개인정보 수집 및 이용 동의 거부 권리
        귀하는 개인정보 수집 및 이용에 대한 동의를 거부할 권리가 있습니다. 다만, 필수 항목의 수집 및 이용에 대한 동의를 거부하시는 경우 회원가입 및 서비스 이용이 제한될 수 있습니다.
        선택 항목의 수집 및 이용에 대한 동의를 거부하시는 경우에도 서비스 이용은 가능하나, 일부 맞춤형 서비스 제공이 제한될 수 있습니다.

        5. 개인정보의 제3자 제공
        회사는 원칙적으로 이용자의 개인정보를 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.

        - 이용자가 사전에 동의한 경우
        - 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우
    </p>
</body>
</html>